SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       ##    #
#  #   #   #    #  #                #  #  #
#  #####   #   ###    ###  #  #       #  ####
#  #   #   #    #  #  #  # #  #      #   #   #
#  #   #   #    #  #  #  #  ###     ####  ###
#_____________________________#_________________________________________________
                           ###


attiny26.build.board=AVR_ATTINY26
attiny26.build.core=tiny
attiny26.build.variant=tiny26
attiny26.build.export_merged_output=false
attiny26.bootloader.extended_fuses=0xFF
attiny26.bootloader.high_fuses=0b111{bootloader.rstbit}0{bootloader.eesave_bit}{bootloader.bod_bits}
attiny26.bootloader.rstbit=1
attiny26.build.usbpinset=
attiny26.build.tuneorcal=
attiny26.build.softserabr=
attiny26.build.softser=
attiny26.build.wiremodeabr=
attiny26.build.wiremode=
attiny26.build.pinmapabr=
attiny26.build.remap=
attiny26.build.remapabr=
attiny26.upload.tool=avrdude
attiny26.bootloader.tool=avrdude
attiny26.build.bootloader=
attiny26.build.bootloaderabr=
attiny26.bootloader.flashstring=

################################
# Optimization menu            #
################################
attiny26.menu.optimization.size=-Os (size, recommended)
attiny26.menu.optimization.othree=-O3 (speed)
attiny26.menu.optimization.debug=-Og (for advanced debugging)
attiny26.menu.optimization.size.build.optimize=-Os
attiny26.menu.optimization.othree.build.optimize=-O3
attiny26.menu.optimization.debug.build.optimize=-Og
attiny26.build.mcu=attiny26
attiny26.upload.maximum_size=2048
attiny26.upload.maximum_data_size=128

################################
# Clocking menu options        #
################################
attiny26.menu.clock.internal_1m=1 MHz (internal) Start-up time: 6 CK + 64ms
attiny26.menu.clock.internal_1m.bootloader.low_fuses=0xE1
attiny26.menu.clock.internal_1m.build.f_cpu=1000000UL
attiny26.menu.clock.internal_1m.build.speed=1m
attiny26.menu.clock.internal_1m.build.clocksource=0x10
attiny26.menu.clock.internal_2m=2 MHz (internal) Start-up time: 6 CK + 64ms
attiny26.menu.clock.internal_2m.bootloader.low_fuses=0xD2
attiny26.menu.clock.internal_2m.build.f_cpu=2000000UL
attiny26.menu.clock.internal_2m.build.speed=2m
attiny26.menu.clock.internal_2m.build.clocksource=0x10
attiny26.menu.clock.internal_4m=4 MHz (internal) Start-up time: 6 CK + 64ms
attiny26.menu.clock.internal_4m.bootloader.low_fuses=0xE3
attiny26.menu.clock.internal_4m.build.f_cpu=4000000UL
attiny26.menu.clock.internal_4m.build.speed=4m
attiny26.menu.clock.internal_4m.build.clocksource=0x10
attiny26.menu.clock.internal_8m=8 MHz (internal) Start-up time: 6 CK + 64ms
attiny26.menu.clock.internal_8m.bootloader.low_fuses=0xE4
attiny26.menu.clock.internal_8m.build.f_cpu=8000000UL
attiny26.menu.clock.internal_8m.build.speed=8m
attiny26.menu.clock.internal_8m.build.clocksource=0x10
attiny26.menu.clock.pll_16m=16 MHz (PLL) Start-up time: 1k CK + 64ms
attiny26.menu.clock.pll_16m.bootloader.low_fuses=0x61
attiny26.menu.clock.pll_16m.build.f_cpu=16000000UL
attiny26.menu.clock.pll_16m.build.speed=16m
attiny26.menu.clock.pll_16m.build.clocksource=6
attiny26.menu.clock.crystal_16m=16 MHz (crystal) Start-up time: 1k CK + 64ms
attiny26.menu.clock.crystal_16m.bootloader.low_fuses=0xCF
attiny26.menu.clock.crystal_16m.build.f_cpu=16000000UL
attiny26.menu.clock.crystal_16m.build.speed=16m
attiny26.menu.clock.crystal_16m.build.clocksource=1
attiny26.menu.clock.crystal_12m=12 MHz (crystal) Start-up time: 1k CK + 64ms
attiny26.menu.clock.crystal_12m.bootloader.low_fuses=0xCF
attiny26.menu.clock.crystal_12m.build.f_cpu=12000000UL
attiny26.menu.clock.crystal_12m.build.speed=12m
attiny26.menu.clock.crystal_12m.build.clocksource=1
attiny26.menu.clock.crystal_8m=8 MHz (crystal) Start-up time: 1k CK + 64ms
attiny26.menu.clock.crystal_8m.bootloader.low_fuses=0xCF
attiny26.menu.clock.crystal_8m.build.f_cpu=8000000UL
attiny26.menu.clock.crystal_8m.build.speed=8m
attiny26.menu.clock.crystal_8m.build.clocksource=1
attiny26.menu.clock.crystal_6m=6 MHz (crystal) Start-up time: 1k CK + 64ms
attiny26.menu.clock.crystal_6m.bootloader.low_fuses=0xCF
attiny26.menu.clock.crystal_6m.build.f_cpu=6000000UL
attiny26.menu.clock.crystal_6m.build.speed=6m
attiny26.menu.clock.crystal_6m.build.clocksource=1
attiny26.menu.clock.extclk_16m=16 MHz (external clock) Start-up time: 6 CK + 64ms
attiny26.menu.clock.extclk_16m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_16m.build.f_cpu=16000000UL
attiny26.menu.clock.extclk_16m.build.speed=16m
attiny26.menu.clock.extclk_16m.build.clocksource=2
attiny26.menu.clock.extclk_12m=12 MHz (external clock) Start-up time: 6 CK + 64ms
attiny26.menu.clock.extclk_12m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_12m.build.f_cpu=12000000UL
attiny26.menu.clock.extclk_12m.build.speed=12m
attiny26.menu.clock.extclk_12m.build.clocksource=2
attiny26.menu.clock.extclk_8m=8 MHz (external clock) Start-up time: 6 CK + 64ms
attiny26.menu.clock.extclk_8m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_8m.build.f_cpu=8000000UL
attiny26.menu.clock.extclk_8m.build.speed=8m
attiny26.menu.clock.extclk_8m.build.clocksource=2
attiny26.menu.clock.extclk_6m=6 MHz (external clock) Start-up time: 6 CK + 64ms
attiny26.menu.clock.extclk_6m.bootloader.low_fuses=0xE0
attiny26.menu.clock.extclk_6m.build.f_cpu=6000000UL
attiny26.menu.clock.extclk_6m.build.speed=6m
attiny26.menu.clock.extclk_6m.build.clocksource=2

################################
# Retain EEPROM menu           #
################################
attiny26.menu.eesave.aenable=EEPROM retained
attiny26.menu.eesave.aenable.bootloader.eesave_bit=0
attiny26.menu.eesave.disable=EEPROM not retained
attiny26.menu.eesave.disable.bootloader.eesave_bit=1

################################
# Software Serial menu         #
################################
attiny26.menu.softserial.enable=RX on PA7, TX on PA (default PA6)
attiny26.menu.softserial.txonly=No receiving, transmit only.
attiny26.menu.softserial.txonly.build.softser=-DSOFT_TX_ONLY
attiny26.menu.softserial.txonly.build.softserabr=ssTX

################################
# BrownOut Detect menu         #
################################
attiny26.menu.bod.disable=B.O.D. Disabled (saves power)
attiny26.menu.bod.disable.bootloader.bod_bits=11
attiny26.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny26.menu.bod.2v7.bootloader.bod_bits=10
attiny26.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny26.menu.bod.4v3.bootloader.bod_bits=00

################################
# millis/micros menu           #
################################
attiny26.menu.millis.enabled=Enabled
attiny26.menu.millis.enabled.build.millis=
attiny26.menu.millis.enabled.build.millisabr=
attiny26.menu.millis.disabled=Disabled (saves flash)
attiny26.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny26.menu.millis.disabled.build.millisabr=mNONE


