SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       ### #####         #   #  ###  ####
#  #   #   #    #  #                #   #    #         #   # #     #   #
#  #####   #   ###    ###  #  #      ###    #      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #     #   #  #       # # #   #     # #   #
#  #   #   #    #  #  #  #  ###      ###  #         #   ###  ####  ####
#_____________________________#_________________________________________________
                           ###


attiny87micr.build.board=AVR_ATTINY87
attiny87micr.build.core=tiny
attiny87micr.build.variant=tinyx7_digi
attiny87micr.build.export_merged_output=false
attiny87micr.bootloader.extended_fuses=0xFE
attiny87micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny87micr.bootloader.rstbit=1
attiny87micr.build.usbpinset=
attiny87micr.build.tuneorcal=
attiny87micr.build.softserabr=
attiny87micr.build.softser=
attiny87micr.build.wiremodeabr=
attiny87micr.build.wiremode=
attiny87micr.build.remap=
attiny87micr.build.remapabr=
attiny87micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attiny87micr.build.bootloaderabr=micr
attiny87micr.upload.tool=micronucleus
attiny87micr.upload.protocol=usb
attiny87micr.bootloader.devpostfix=

################################
# Optimization menu            #
################################
attiny87micr.menu.optimization.size=-Os (size, recommended)
attiny87micr.menu.optimization.othree=-O3 (speed)
attiny87micr.menu.optimization.debug=-Og (for advanced debugging)
attiny87micr.menu.optimization.size.build.optimize=-Os
attiny87micr.menu.optimization.othree.build.optimize=-O3
attiny87micr.menu.optimization.debug.build.optimize=-Og
attiny87micr.build.mcu=attiny87
attiny87micr.upload.maximum_size=6780
attiny87micr.upload.maximum_data_size=512

################################
# Clocking menu options        #
################################
attiny87micr.menu.clock.crystal_16m=16 MHz (external crystal)
attiny87micr.menu.clock.crystal_16m.bootloader.low_fuses=0xF0
attiny87micr.menu.clock.crystal_16m.build.f_cpu=16000000UL
attiny87micr.menu.clock.crystal_16m.build.speed=16m
attiny87micr.menu.clock.crystal_16m.build.clocksource=1
attiny87micr.menu.clock.crystal_8m=8 MHz (prescaled 16 MHz external crystal)
attiny87micr.menu.clock.crystal_8m.bootloader.low_fuses=0xF0
attiny87micr.menu.clock.crystal_8m.build.f_cpu=8000000UL
attiny87micr.menu.clock.crystal_8m.build.speed=8m
attiny87micr.menu.clock.crystal_8m.build.clocksource=0x11
attiny87micr.menu.clock.crystal_4m=4 MHz (prescaled 16 MHz external crystal)
attiny87micr.menu.clock.crystal_4m.bootloader.low_fuses=0xF0
attiny87micr.menu.clock.crystal_4m.build.f_cpu=4000000UL
attiny87micr.menu.clock.crystal_4m.build.speed=4m
attiny87micr.menu.clock.crystal_4m.build.clocksource=0x11
attiny87micr.menu.clock.crystal_2m=2 MHz (prescaled 16 MHz external crystal)
attiny87micr.menu.clock.crystal_2m.bootloader.low_fuses=0xF0
attiny87micr.menu.clock.crystal_2m.build.f_cpu=2000000UL
attiny87micr.menu.clock.crystal_2m.build.speed=2m
attiny87micr.menu.clock.crystal_2m.build.clocksource=0x11
attiny87micr.menu.clock.crystal_1m=1 MHz (prescaled 16 MHz external crystal)
attiny87micr.menu.clock.crystal_1m.bootloader.low_fuses=0xF0
attiny87micr.menu.clock.crystal_1m.build.f_cpu=1000000UL
attiny87micr.menu.clock.crystal_1m.build.speed=1m
attiny87micr.menu.clock.crystal_1m.build.clocksource=0x11

################################
# Pin Mapping menu             #
################################
attiny87micr.menu.pinmap.digi=Digispark Pro
attiny87micr.menu.pinmap.standard=Standard/Azduino
attiny87micr.menu.pinmap.standard.build.variant=tinyx7
attiny87micr.menu.pinmap.digi.build.variant=tinyx7_digi
attiny87micr.menu.pinmap.legacy=Legacy
attiny87micr.menu.pinmap.legacy.build.variant=tinyx7_legacy
attiny87micr.menu.pinmap.default.build.pinmapabr=
attiny87micr.menu.pinmap.digi.build.pinmapabr=.digi
attiny87micr.menu.pinmap.legacy.build.pinmapabr=.old

################################
# BrownOut Detect menu         #
################################
attiny87micr.menu.bod.disable=B.O.D. Disabled (saves power)
attiny87micr.menu.bod.disable.bootloader.bod_bits=111
attiny87micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny87micr.menu.bod.1v8.bootloader.bod_bits=110
attiny87micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny87micr.menu.bod.2v7.bootloader.bod_bits=101
attiny87micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny87micr.menu.bod.4v3.bootloader.bod_bits=100

################################
# millis/micros menu           #
################################
attiny87micr.menu.millis.enabled=Enabled
attiny87micr.menu.millis.enabled.build.millis=
attiny87micr.menu.millis.enabled.build.millisabr=
attiny87micr.menu.millis.disabled=Disabled (saves flash)
attiny87micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny87micr.menu.millis.disabled.build.millisabr=mNONE

################################
# Boot Entrymode menu          #
################################
attiny87micr.menu.bootentry.extrf_porf=External Reset and Power On Reset
attiny87micr.menu.bootentry.extrf_porf.bootloader.entrymode=extrf_porf
attiny87micr.menu.bootentry.extrf_safe=External Reset, or if reset pin disabled and HIGH
attiny87micr.menu.bootentry.extrf_safe.bootloader.entrymode=extrf_safe
attiny87micr.menu.bootentry.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attiny87micr.menu.bootentry.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attiny87micr.menu.bootentry.wdrf=Watchdog Reset only
attiny87micr.menu.bootentry.wdrf.bootloader.entrymode=wdrf
attiny87micr.menu.bootentry.porf=Power On Reset only
attiny87micr.menu.bootentry.porf.bootloader.entrymode=porf
attiny87micr.menu.bootentry.anyreset=Any reset (but not jump from app)
attiny87micr.menu.bootentry.anyreset.bootloader.entrymode=anyreset
attiny87micr.menu.bootentry.always=Always (permits jump from app)
attiny87micr.menu.bootentry.always.bootloader.entrymode=always
attiny87micr.menu.bootentry.jumper=Jumper (see documentation) (permits jump from app)
attiny87micr.menu.bootentry.jumper.bootloader.entrymode=jumper
attiny87micr.menu.bootentry.jumper.upload.maximum_size=6716

################################
# Pins used for USB            #
################################
attiny87micr.menu.usbpins.digispark=Digispark Pro - PB3: D-, PB6: D+, PB1: LED
attiny87micr.menu.usbpins.azduino=Azduino 167 USB - PB3: D-, PB6: D+, PA6: LED
attiny87micr.menu.usbpins.digispark.build.usbpinset=-DLED_BUILTIN=PIN_PB1
attiny87micr.menu.usbpins.azduino.build.usbpinset=-DLED_BUILTIN=PIN_PA6
attiny87micr.menu.usbpins.digispark.bootloader.usbpinsetname=pb1led
attiny87micr.menu.usbpins.azduino.bootloader.usbpinsetname=pa6led
attiny87micr.menu.usbpins.azduino.upload.maximum_size=6652
attiny87micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attiny87micr.menu.resetpin.reset.bootloader.rstbit=1
attiny87micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attiny87micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attiny87micr.menu.burnmode.upgrade=Upgrade (via USB)
attiny87micr.menu.burnmode.upgrade.bootloader.file={runtime.platform.path}/bootloaders/micronucleus/upgrade-attiny87{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny87micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attiny87micr.menu.burnmode.install=Fresh Install (via ISP)
attiny87micr.menu.burnmode.install.bootloader.file={runtime.platform.path}/bootloaders/micronucleus/attiny87{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny87micr.menu.burnmode.install.bootloader.tool=avrdude
attiny87micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i


