SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                            #    ##          #   #  ###  ####
#  #   #   #    #  #                     #    ###          #   # #     #   #
#  #####   #   ###    ###  #  #     # # ####   ##      # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #      #  #   #  ##      # # #   #     # #   #
#  #   #   #    #  #  #  #  ###     # #  ###  ####      #   ###  ####  ####
#_____________________________#_________________________________________________
                           ###


attiny861micr.build.board=AVR_ATTINY861
attiny861micr.build.core=tiny
attiny861micr.build.variant=tinyx61
attiny861micr.build.export_merged_output=false
attiny861micr.bootloader.extended_fuses=0xFE
attiny861micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny861micr.bootloader.rstbit=1
attiny861micr.build.usbpinset=
attiny861micr.build.tuneorcal=
attiny861micr.build.softserabr=
attiny861micr.build.softser=
attiny861micr.build.wiremodeabr=
attiny861micr.build.wiremode=
attiny861micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attiny861micr.build.bootloaderabr=micr
attiny861micr.upload.tool=micronucleus
attiny861micr.upload.protocol=usb
attiny861micr.bootloader.devpostfix=

################################
# Optimization menu            #
################################
attiny861micr.menu.optimization.size=-Os (size, recommended)
attiny861micr.menu.optimization.othree=-O3 (speed)
attiny861micr.menu.optimization.debug=-Og (for advanced debugging)
attiny861micr.menu.optimization.size.build.optimize=-Os
attiny861micr.menu.optimization.othree.build.optimize=-O3
attiny861micr.menu.optimization.debug.build.optimize=-Og
attiny861micr.build.mcu=attiny861
attiny861micr.upload.maximum_size=6524
attiny861micr.upload.maximum_data_size=512

################################
# Clocking menu options        #
################################
attiny861micr.build.extra_flags=-DBOOT_TUNED165
attiny861micr.menu.clock.pll_165m=16.5 MHz (internal tuned PLL)
attiny861micr.menu.clock.pll_165m.bootloader.low_fuses=0xF1
attiny861micr.menu.clock.pll_165m.build.f_cpu=16500000UL
attiny861micr.menu.clock.pll_165m.build.speed=16m5
attiny861micr.menu.clock.pll_165m.build.clocksource=6
attiny861micr.menu.clock.pll_16m=16 MHz (internal PLL)
attiny861micr.menu.clock.pll_16m.bootloader.low_fuses=0xF1
attiny861micr.menu.clock.pll_16m.build.f_cpu=16000000UL
attiny861micr.menu.clock.pll_16m.build.speed=16m
attiny861micr.menu.clock.pll_16m.build.clocksource=6
attiny861micr.menu.clock.pll_8m=8 MHz (prescaled 16 MHz internal PLL)
attiny861micr.menu.clock.pll_8m.bootloader.low_fuses=0xF1
attiny861micr.menu.clock.pll_8m.build.f_cpu=8000000UL
attiny861micr.menu.clock.pll_8m.build.speed=8m
attiny861micr.menu.clock.pll_8m.build.clocksource=0x16
attiny861micr.menu.clock.pll_4m=4 MHz (prescaled 16 MHz internal PLL)
attiny861micr.menu.clock.pll_4m.bootloader.low_fuses=0xF1
attiny861micr.menu.clock.pll_4m.build.f_cpu=4000000UL
attiny861micr.menu.clock.pll_4m.build.speed=4m
attiny861micr.menu.clock.pll_4m.build.clocksource=0x16
attiny861micr.menu.clock.pll_2m=2 MHz (prescaled 16 MHz internal PLL)
attiny861micr.menu.clock.pll_2m.bootloader.low_fuses=0xF1
attiny861micr.menu.clock.pll_2m.build.f_cpu=2000000UL
attiny861micr.menu.clock.pll_2m.build.speed=2m
attiny861micr.menu.clock.pll_2m.build.clocksource=0x16
attiny861micr.menu.clock.pll_1m=1 MHz (prescaled 16 MHz internal PLL)
attiny861micr.menu.clock.pll_1m.bootloader.low_fuses=0xF1
attiny861micr.menu.clock.pll_1m.build.f_cpu=1000000UL
attiny861micr.menu.clock.pll_1m.build.speed=1m
attiny861micr.menu.clock.pll_1m.build.clocksource=0x16

################################
# Pin Mapping menu             #
################################
attiny861micr.menu.pinmap.default=Standard
attiny861micr.menu.pinmap.legacy=Legacy
attiny861micr.menu.pinmap.legacy.build.variant=tinyx61_legacy
attiny861micr.menu.pinmap.default.build.pinmapabr=
attiny861micr.menu.pinmap.legacy.build.pinmapabr=.old
attiny861micr.menu.remap.default=USI on PB0-PB2
attiny861micr.menu.remap.alternate=USI on PA0-PA2
attiny861micr.menu.remap.default.build.remap=
attiny861micr.menu.remap.alternate.build.remap=-DSET_REMAPUSI
attiny861micr.menu.remap.default.build.remapabr=
attiny861micr.menu.remap.alternate.build.remapabr=rU

################################
# BrownOut Detect menu         #
################################
attiny861micr.menu.bod.disable=B.O.D. Disabled (saves power)
attiny861micr.menu.bod.disable.bootloader.bod_bits=111
attiny861micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny861micr.menu.bod.1v8.bootloader.bod_bits=110
attiny861micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny861micr.menu.bod.2v7.bootloader.bod_bits=101
attiny861micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny861micr.menu.bod.4v3.bootloader.bod_bits=100

################################
# millis/micros menu           #
################################
attiny861micr.menu.millis.enabled=Enabled
attiny861micr.menu.millis.enabled.build.millis=
attiny861micr.menu.millis.enabled.build.millisabr=
attiny861micr.menu.millis.disabled=Disabled (saves flash)
attiny861micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny861micr.menu.millis.disabled.build.millisabr=mNONE

################################
# Boot Entrymode menu          #
################################
attiny861micr.menu.bootentry.extrf_porf=External Reset and Power On Reset
attiny861micr.menu.bootentry.extrf_porf.bootloader.entrymode=extrf_porf
attiny861micr.menu.bootentry.extrf_safe=External Reset, or if reset pin disabled and HIGH
attiny861micr.menu.bootentry.extrf_safe.bootloader.entrymode=extrf_safe
attiny861micr.menu.bootentry.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attiny861micr.menu.bootentry.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attiny861micr.menu.bootentry.wdrf=Watchdog Reset only
attiny861micr.menu.bootentry.wdrf.bootloader.entrymode=wdrf
attiny861micr.menu.bootentry.porf=Power On Reset only
attiny861micr.menu.bootentry.porf.bootloader.entrymode=porf
attiny861micr.menu.bootentry.anyreset=Any reset (but not jump from app)
attiny861micr.menu.bootentry.anyreset.bootloader.entrymode=anyreset
attiny861micr.menu.bootentry.always=Always (permits jump from app)
attiny861micr.menu.bootentry.always.bootloader.entrymode=always
attiny861micr.menu.bootentry.jumper=Jumper (see documentation) (permits jump from app)
attiny861micr.menu.bootentry.jumper.bootloader.entrymode=jumper

################################
# Pins used for USB            #
################################
attiny861micr.menu.usbpins.standard=Standard - PB4: D-, PB6: D+, PA5: LED
attiny861micr.menu.usbpins.standard.bootloader.usbpinset=-DLED_BUILTIN=PIN_PB4 -DLED_BUILTIN2=PIN_PA4
attiny861micr.menu.usbpins.standard.bootloader.usbpinsetname=
attiny861micr.menu.usbpins.prototype=Prototype - PA4: D+, PA5: D-, PB6: LED
attiny861micr.menu.usbpins.prototype.bootloader.usbpinset=-DLED_BUILTIN=PIN_PB6
attiny861micr.menu.usbpins.prototype.bootloader.usbpinsetname=_proto
attiny861micr.menu.usbpins.prototype.upload.maximum_size=6460
attiny861micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attiny861micr.menu.resetpin.reset.bootloader.rstbit=1
attiny861micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attiny861micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attiny861micr.menu.burnmode.upgrade=Upgrade (via USB)
attiny861micr.menu.burnmode.upgrade.bootloader.file={runtime.platform.path}/bootloaders/micronucleus/upgrade-attiny861{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny861micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attiny861micr.menu.burnmode.install=Fresh Install (via ISP)
attiny861micr.menu.burnmode.install.bootloader.file={runtime.platform.path}/bootloaders/micronucleus/attiny861{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny861micr.menu.burnmode.install.bootloader.tool=avrdude
attiny861micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i


