SpenceKonde/ATTinyCore/avr/boards.txt
#*******************************************************************************
#   ###  #####                       #    #   ###  #  #        #   #  ###  ####
#  #   #   #    #  #                ##   #       # #  #        #   # #     #   #
#  #####   #   ###    ###  #  #      #  ####   ##  ####    # # #   #  ###  ####
#  #   #   #    #  #  #  # #  #      #  #   #    #    #    # # #   #     # #   #
#  #   #   #    #  #  #  #  ###     ###  ###  ###     #     #   ###  ####  ####
#_____________________________#_________________________________________________
                           ###


attiny1634micr.build.board=AVR_ATTINY1634
attiny1634micr.build.core=tiny
attiny1634micr.build.variant=tiny1634_cw
attiny1634micr.build.export_merged_output=false
attiny1634micr.bootloader.extended_fuses=0b111{bootloader.bodpd_bits}{bootloader.bodact_bits}0
attiny1634micr.bootloader.high_fuses=0b{bootloader.rstbit}1011{bootloader.bod_bits}
attiny1634micr.bootloader.rstbit=1
attiny1634micr.build.usbpinset=
attiny1634micr.build.tuneorcal=
attiny1634micr.build.softserabr=
attiny1634micr.build.softser=
attiny1634micr.build.wiremodeabr=
attiny1634micr.build.wiremode=
attiny1634micr.build.remap=
attiny1634micr.build.remapabr=
attiny1634micr.build.bootloader=-DUSING_BOOTLOADER=0x08
attiny1634micr.build.bootloaderabr=micr
attiny1634micr.upload.tool=micronucleus
attiny1634micr.upload.protocol=usb
attiny1634micr.bootloader.devpostfix=

################################
# Optimization menu            #
################################
attiny1634micr.menu.optimization.size=-Os (size, recommended)
attiny1634micr.menu.optimization.othree=-O3 (speed)
attiny1634micr.menu.optimization.debug=-Og (for advanced debugging)
attiny1634micr.menu.optimization.size.build.optimize=-Os
attiny1634micr.menu.optimization.othree.build.optimize=-O3
attiny1634micr.menu.optimization.debug.build.optimize=-Og
attiny1634micr.build.mcu=attiny1634
attiny1634micr.upload.maximum_size=14720
attiny1634micr.upload.maximum_data_size=1024

################################
# Clocking menu options        #
################################
attiny1634micr.menu.clock.internal_8m=8 MHz
attiny1634micr.menu.clock.internal_8m.bootloader.low_fuses=0xE2
attiny1634micr.menu.clock.internal_8m.build.f_cpu=8000000UL
attiny1634micr.menu.clock.internal_8m.build.speed=8m
attiny1634micr.menu.clock.internal_8m.build.clocksource=0
attiny1634micr.menu.clock.internal_8m.build.extra_flags=-DBOOT_TUNED120
attiny1634micr.menu.clock.internal_12m=12 MHz (tuned by bootloader)
attiny1634micr.menu.clock.internal_12m.bootloader.low_fuses=0xE2
attiny1634micr.menu.clock.internal_12m.build.f_cpu=12000000UL
attiny1634micr.menu.clock.internal_12m.build.speed=12m
attiny1634micr.menu.clock.internal_12m.build.clocksource=0
attiny1634micr.menu.clock.internal_12m.build.extra_flags=-DBOOT_TUNED120

################################
# Pin Mapping menu             #
################################
attiny1634micr.menu.pinmap.default=Standard (clockwise)
attiny1634micr.menu.pinmap.ccw=Legacy (counterclockwise)
attiny1634micr.menu.pinmap.ccw.build.variant=tiny1634_legacy
attiny1634micr.menu.pinmap.default.build.pinmapabr=.cw
attiny1634micr.menu.pinmap.ccw.build.pinmapabr=.ccw

################################
# BrownOut Detect menu         #
################################
attiny1634micr.menu.bod.1v8=B.O.D. Enabled (1.8v)
attiny1634micr.menu.bod.1v8.bootloader.bod_bits=110
attiny1634micr.menu.bod.2v7=B.O.D. Enabled (2.7v)
attiny1634micr.menu.bod.2v7.bootloader.bod_bits=101
attiny1634micr.menu.bod.4v3=B.O.D. Enabled (4.3v)
attiny1634micr.menu.bod.4v3.bootloader.bod_bits=100
attiny1634micr.menu.bodact.disabled=B.O.D. Disabled (saves power)
attiny1634micr.menu.bodact.disabled.bootloader.bodact_bits=11
attiny1634micr.menu.bodact.enabled=B.O.D. Enabled
attiny1634micr.menu.bodact.enabled.bootloader.bodact_bits=10
attiny1634micr.menu.bodact.sampled=B.O.D. Sampled Mode
attiny1634micr.menu.bodact.sampled.bootloader.bodact_bits=01
attiny1634micr.menu.bodpd.disabled=B.O.D. Disabled (saves power)
attiny1634micr.menu.bodpd.disabled.bootloader.bodpd_bits=11
attiny1634micr.menu.bodpd.enabled=B.O.D. Enabled
attiny1634micr.menu.bodpd.enabled.bootloader.bodpd_bits=10
attiny1634micr.menu.bodpd.sampled=B.O.D. Sampled Mode
attiny1634micr.menu.bodpd.sampled.bootloader.bodpd_bits=01

################################
# millis/micros menu           #
################################
attiny1634micr.menu.millis.enabled=Enabled
attiny1634micr.menu.millis.enabled.build.millis=
attiny1634micr.menu.millis.enabled.build.millisabr=
attiny1634micr.menu.millis.disabled=Disabled (saves flash)
attiny1634micr.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attiny1634micr.menu.millis.disabled.build.millisabr=mNONE

################################
# Boot Entrymode menu          #
################################
attiny1634micr.menu.bootentry.extrf_porf=External Reset and Power On Reset
attiny1634micr.menu.bootentry.extrf_porf.bootloader.entrymode=extrf_porf
attiny1634micr.menu.bootentry.extrf_safe=External Reset, or if reset pin disabled and HIGH
attiny1634micr.menu.bootentry.extrf_safe.bootloader.entrymode=extrf_safe
attiny1634micr.menu.bootentry.extrfonly_safe=External Reset only, or if reset pin disabled and HIGH
attiny1634micr.menu.bootentry.extrfonly_safe.bootloader.entrymode=extrfonly_safe
attiny1634micr.menu.bootentry.wdrf=Watchdog Reset only
attiny1634micr.menu.bootentry.wdrf.bootloader.entrymode=wdrf
attiny1634micr.menu.bootentry.porf=Power On Reset only
attiny1634micr.menu.bootentry.porf.bootloader.entrymode=porf
attiny1634micr.menu.bootentry.anyreset=Any reset (but not jump from app)
attiny1634micr.menu.bootentry.anyreset.bootloader.entrymode=anyreset
attiny1634micr.menu.bootentry.always=Always (permits jump from app)
attiny1634micr.menu.bootentry.always.bootloader.entrymode=always
attiny1634micr.menu.bootentry.jumper=Jumper (see documentation) (permits jump from app)
attiny1634micr.menu.bootentry.jumper.bootloader.entrymode=jumper

################################
# Pins used for USB            #
################################
attiny1634micr.menu.usbpins.standard=Standard: PC4: D-, PC5: D+, PC2: LED
attiny1634micr.menu.usbpins.standard.bootloader.usbpinset=-DLED_BUILTIN=PIN_PC2
attiny1634micr.menu.usbpins.standard.bootloader.usbpinsetname=
attiny1634micr.menu.resetpin.reset=Reset pin. Further ISP programming possible
attiny1634micr.menu.resetpin.reset.bootloader.rstbit=1
attiny1634micr.menu.resetpin.gpio=I/O pin - DANGER: If anything goes wrong, only HV programming can unbrick!
attiny1634micr.menu.resetpin.gpio.bootloader.rstbit=0

################################
# Upgrade vs ISP install menu  #
################################
attiny1634micr.menu.burnmode.upgrade=Upgrade (via USB)
attiny1634micr.menu.burnmode.upgrade.bootloader.file={runtime.platform.path}/bootloaders/micronucleus/upgrade-attiny1634{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny1634micr.menu.burnmode.upgrade.bootloader.tool=micronucleus
attiny1634micr.menu.burnmode.install=Fresh Install (via ISP)
attiny1634micr.menu.burnmode.install.bootloader.file={runtime.platform.path}/bootloaders/micronucleus/attiny1634{bootloader.devpostfix}{bootloader.usbpinsetname}_{bootloader.entrymode}.hex
attiny1634micr.menu.burnmode.install.bootloader.tool=avrdude
attiny1634micr.menu.burnmode.install.bootloader.flashstring=-Uflash:w:{bootloader.file}:i
